In [1]:
# This is Matthew Buck's Module 4 Challenge Assignment for the Bootcamp: "CARL-VIRT-DATA-PT-09-2022-U-B-MW"

In [2]:
cd C:\Users\mbuck\Documents\Matt's Files\Personal\School\Data Bootcamp\Challenges\Student_Data_Challenge_Starter_Code

C:\Users\mbuck\Documents\Matt's Files\Personal\School\Data Bootcamp\Challenges\Student_Data_Challenge_Starter_Code

In [3]:
# Import the data from the new_full_student_data.csv
import pandas as pd
import os
import numpy as np

student_data = os.path.join('Resources/new_full_student_data.csv')
student_df = pd.read_csv(student_data)

student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

In [4]:
# Check the rows that have NaN values and remove those rows
student_df = student_df.dropna()
student_df.isna().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [5]:
# Check for duplicate rows
student_df.duplicated().sum()

1836

In [6]:
# Drop the duplicate rows
student_df = student_df.drop_duplicates()
student_df.duplicated().sum()

0

In [7]:
# Check the data types of the columns
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [8]:
# Replace the "th" suffix
student_df['grade'] = student_df['grade'].str.replace('th','')
student_df['grade']

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: object

In [9]:
# Change the "grade" column to an intiger
student_df['grade'] = student_df['grade'].astype(int)
student_df.dtypes

student_id         int64
student_name      object
grade              int32
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [10]:
# Generate the summery statistics for the student DataFrame
student_df.describe()

         student_id         grade  reading_score    math_score  school_budget
count  1.483100e+04  14831.000000   14831.000000  14831.000000   14831.000000
mean   6.975296e+07     10.355539      72.357865     64.675733  893742.749107
std    3.452909e+07      1.097728      15.224590     15.844093   53938.066467
min    1.000906e+07      9.000000      10.500000      3.700000  817615.000000
25%    3.984433e+07      9.000000      62.200000     54.500000  846745.000000
50%    6.965978e+07     10.000000      73.800000     65.300000  893368.000000
75%    9.927449e+07     11.000000      84.000000     76.000000  956438.000000
max    1.299997e+08     12.000000     100.000000    100.000000  991918.000000

In [11]:
# Display the mean math score
avg_math_score = student_df['math_score'].mean
avg_math_score

<bound method NDFrame._add_numeric_operations.<locals>.mean of 0        88.2
1        73.5
2        70.4
3        80.3
5        76.9
         ...
19508    64.6
19509    27.2
19511    84.1
19512    70.9
19513    42.4
Name: math_score, Length: 14831, dtype: float64>

In [12]:
# Store the minimum reading score in min_reading_score
min_reading_score = student_df['reading_score'].min()

In [13]:
# Display the grade columns
student_df.loc[:,['grade']]

       grade
0          9
1          9
2          9
3          9
5          9
...      ...
19508     10
19509     12
19511     11
19512     11
19513     12

[14831 rows x 1 columns]

In [14]:
# Display the first three rows of Columns 3, 4, and 5
student_df.iloc[:3,[3,4,5]]

            school_name  reading_score  math_score
0  Sullivan High School           59.0        88.2
1     Dixon High School           94.7        73.5
2    Wagner High School           89.0        70.4

In [15]:
# Display the summary statistics for Grade 9
grade_9_df = student_df.loc[student_df["grade"] == 9]
grade_9_df.describe()

         student_id   grade  reading_score   math_score  school_budget
count  4.132000e+03  4132.0    4132.000000  4132.000000    4132.000000
mean   6.979441e+07     9.0      69.236713    66.585624  898692.606002
std    3.470565e+07     0.0      15.277354    16.661533   54891.596611
min    1.000906e+07     9.0      17.900000     5.300000  817615.000000
25%    3.953848e+07     9.0      59.000000    56.000000  846745.000000
50%    6.984037e+07     9.0      70.050000    67.800000  893368.000000
75%    9.939504e+07     9.0      80.500000    78.500000  957299.000000
max    1.299997e+08     9.0      99.900000   100.000000  991918.000000

In [16]:
# Store the row with the minimum overall reading score
min_reading_row = student_df.loc[student_df["reading_score"] == min_reading_score]
min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10,Dixon High School,10.5,58.4,Charter,870334

In [17]:
# Select all the reading scores from the 10th grades at Dixon High School
dixon_students = student_df.loc[student_df["school_name"] == "Dixon High School"]
dixon_10s = dixon_students.loc[student_df["grade"] == 10]
dixon_10s.loc[:,["school_name","reading_score"]]

             school_name  reading_score
45     Dixon High School           71.1
60     Dixon High School           59.5
69     Dixon High School           88.6
94     Dixon High School           81.5
100    Dixon High School           95.3
...                  ...            ...
19283  Dixon High School           52.9
19306  Dixon High School           58.0
19344  Dixon High School           38.0
19368  Dixon High School           84.4
19445  Dixon High School           43.9

[569 rows x 2 columns]

In [18]:
# Find the mean reading score for all students in Grades 11 & 12
student_df.loc[student_df["grade"] >10, "reading_score"].mean()

74.90038089192188

In [19]:
# Display the average budget for each school type
school_type_mean = student_df.groupby(by="school_type").mean()
school_type_mean.loc[:, ["school_budget"]]

             school_budget
school_type
Charter      872625.656236
Public       911195.558251

In [20]:
# Find the total number of students at each school
student_count = student_df.groupby("school_name").count()
student_count.loc[:,["student_name"]].sort_values(by="student_name", ascending=False)

                        student_name
school_name
Montgomery High School          2038
Green High School               1961
Dixon High School               1583
Wagner High School              1541
Silva High School               1109
Woods High School               1052
Sullivan High School             971
Turner High School               846
Bowers High School               803
Fisher High School               798
Richard High School              551
Campos High School               541
Odonnell High School             459
Campbell High School             407
Chang High School                171

In [21]:
# Find the average math score by grade for each school type
avg_by_schooltype = student_df.groupby(['school_type','grade']).mean()
rounded_df = avg_by_schooltype.round(decimals=0)
rounded_df.loc[:, ["math_score"]]

                   math_score
school_type grade
Charter     9            70.0
            10           66.0
            11           68.0
            12           60.0
Public      9            64.0
            10           64.0
            11           59.0
            12           64.0